/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   srcs14.c                                           :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ltuffleb <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/04/09 15:38:56 by ltuffleb          #+#    #+#             */
/*   Updated: 2019/04/09 15:38:57 by ltuffleb         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "asm.h"

void	check_end_symbol(t_asm *ch)
{
	char	c[2];

	c[0] = 0;
	if (lseek(ch->fd, -1, 2) == -1L)
	{
		close(ch->fd);
		error_clear_exit(ch, "Ошибка. Файл пуст.", 0, NULL);
	}
	if (read(ch->fd, c, 1) <= 0)
	{
		close(ch->fd);
		error_clear_exit(ch, "Ошибка считывания последнего символа.", 0, NULL);
	}
	if (c[0] != '\n' && ch->tmp != 0)
	{
		close(ch->fd);
		error_clear_exit(ch,
		"Ошибка. Отсутствует заключительный перенос строки.", 0, NULL);
	}
}
